### Import the necessary libraries

In [1]:
import pandas as pd
import sqlalchemy as alch
import pymysql

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [2]:
from getpass import getpass

In [3]:
password = getpass("Introduce tu pass de sql: ")

Introduce tu pass de sql: ········

### Establishes the connection to the database

In [4]:
dbName="publications"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

### Remember to create the engine

In [5]:
from dotenv import load_dotenv
import os

In [6]:
engine = alch.create_engine(connectionData)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [7]:
df = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID', a.au_lname AS 'LAST NAME', 
a.au_fname AS 'FIRST NAME', t.title AS 'TITLE', p.pub_name AS 'PUBLISHER' 
FROM authors AS a
JOIN titleauthor AS ta
ON a.au_id = ta.au_id
LEFT JOIN titles AS t
ON ta.title_id = t.title_id
LEFT JOIN publishers AS p
ON t.pub_id = p.pub_id
ORDER BY a.au_id ASC;

""", engine
)

In [8]:
df.head()

,AUTHOR ID,LAST NAME,FIRST NAME,TITLE,PUBLISHER
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [9]:
df2 = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID', a.au_lname AS 'LAST NAME', a.au_fname AS 'FIRST NAME', 
p.pub_name AS 'PUBLISHER', COUNT(t.title_id) AS 'TITLE COUNT'
FROM authors AS a
JOIN titleauthor AS ta
ON a.au_id = ta.au_id
LEFT JOIN titles AS t
ON ta.title_id = t.title_id
LEFT JOIN publishers AS p
ON t.pub_id = p.pub_id
GROUP BY P.pub_id, a.au_id
ORDER BY a.au_id DESC;

""", engine
)

In [10]:
df2.head()

     AUTHOR ID LAST NAME FIRST NAME             PUBLISHER  TITLE COUNT
0  998-72-3567    Ringer     Albert        New Moon Books            2
1  899-46-2035    Ringer       Anne      Binnet & Hardley            1
2  899-46-2035    Ringer       Anne        New Moon Books            1
3  846-92-7186    Hunter     Sheryl  Algodata Infosystems            1
4  807-91-6654  Panteley     Sylvia      Binnet & Hardley            1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [11]:
df3 = pd.read_sql_query(

"""
SELECT a.au_id AS 'AUTHOR ID', a.au_lname AS 'LAST NAME', a.au_fname AS 'FIRST NAME', SUM(s.qty) AS 'TOTAL'
FROM authors AS a
JOIN titleauthor AS ta
ON a.au_id = ta.au_id
LEFT JOIN titles AS t
ON ta.title_id = t.title_id
RIGHT JOIN sales AS s
ON t.title_id = s.title_id
GROUP BY a.au_id
ORDER BY SUM(s.qty) DESC
LIMIT 3;

""", engine
)

In [12]:
df3.head()

     AUTHOR ID LAST NAME FIRST NAME  TOTAL
0  899-46-2035    Ringer       Anne  148.0
1  998-72-3567    Ringer     Albert  133.0
2  213-46-8915     Green   Marjorie   50.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [13]:
# I saw that adding COALESCE(SUM((s.qty), 0) it is possible to display 0 instead of null. 
# But I am not able to do it with the query from the previous exercise. 
# This is what I get. 

df4 = pd.read_sql_query(

"""
SELECT authors.au_id AS 'author ID', au_lname AS 'last name', au_fname AS 'first name', COALESCE(SUM(qty),0) AS "SUM"
FROM sales
INNER JOIN titleauthor
ON sales.title_id = titleauthor.title_id
RIGHT JOIN authors       
ON titleauthor.au_id = authors.au_id
GROUP BY  authors.au_id
ORDER BY SUM(qty) DESC;

""", engine
)

In [14]:
df4

      author ID       last name   first name    SUM
0   899-46-2035          Ringer         Anne  148.0
1   998-72-3567          Ringer       Albert  133.0
2   213-46-8915           Green     Marjorie   50.0
3   427-17-2319            Dull          Ann   50.0
4   846-92-7186          Hunter       Sheryl   50.0
5   267-41-2394         O'Leary      Michael   45.0
6   724-80-9391      MacFeather      Stearns   45.0
7   722-51-5454        DeFrance       Michel   40.0
8   807-91-6654        Panteley       Sylvia   40.0
9   238-95-7766          Carson       Cheryl   30.0
10  486-29-1786        Locksley     Charlene   25.0
11  472-27-2349      Gringlesby         Burt   20.0
12  648-92-1872  Blotchet-Halls     Reginald   20.0
13  672-71-3249        Yokomoto        Akiko   20.0
14  756-30-7391          Karsen        Livia   20.0
15  172-32-1176           White      Johnson   15.0
16  274-80-9391        Straight         Dean   15.0
17  409-56-7008          Bennet      Abraham   15.0
18  712-45-1867    del Castillo        Innes   10.0
19  341-22-1782           Smith      Meander    0.0
20  527-72-3246          Greene  Morningstar    0.0
21  724-08-9931        Stringer         Dirk    0.0
22  893-72-1158        McBadden      Heather    0.0

## Bonus Challenge - Most Profiting Authors